import random

answers = ["Бесспорно", "Мені здається - так", "Пока незрозуміло, спробуй ще", "Навіть не думай",
           "Вже визначено", "Скоріш за все", "Запитайся пізніше", "Моя відповідь - ні",
           "Ніяких сумнівів", "Гарні перспективи", "Краще не розповідати", "По моїм даним - ні",
           "Можете бути впевнені в цьому", "Знаки кажуть - так", "Зараз неможливо предсказати",
           "Перспективи не дуже" "Так", "Сконцентруйся и запитайся ще раз", "Дуже наврядчи"]
print("Привіт Світ, я магічний шар та маю відповідь на будь яке твоє запитання")
name = input("Давай познайомимось. Як тебе звати? ")
print("Привіт,", name)
again = 'т'

while again.lower() == 'т':
    question = input('Задай мені питання: ')
    print(random.choice(answers))
    again = input('Ще одне питання? (т = так, н = ні): ')

    if not again.lower() == 'т':
        print('Звертайтесь знову!')